In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [5]:
df1 = pd.read_csv('Datasets/perrin-freres-monthly-champagne-.csv')

In [7]:
df1.head()

     Month  Perrin Freres monthly champagne sales millions ?64-?72
0  1964-01                                             2815.0
1  1964-02                                             2672.0
2  1964-03                                             2755.0
3  1964-04                                             2721.0
4  1964-05                                             2946.0

In [8]:
df1.tail()

,Month,Perrin Freres monthly champagne sales millions ?64-?72
102,1972-07,4298.0
103,1972-08,1413.0
104,1972-09,5877.0
105,NaN,NaN
106,Perrin Freres monthly champagne sales millions...,NaN

In [9]:
df2 = pd.read_csv('Datasets/gold_monthly_csv.csv')

In [11]:
df2.head()

      Date  Price
0  1950-01  34.73
1  1950-02  34.73
2  1950-03  34.73
3  1950-04  34.73
4  1950-05  34.73